{
  "posts": [
    {
      "id": "a4c0",
      "title": "Democracy is at stake in the 2024 US",
      "body": "Uncertainty looms large over the 2024 American presidential election. As the list of international crises grows, partisan battles in Congress over foreign policy priorities are heating up, suggesting that fears about America’s future commitments are warranted.\n<br>\n<br>\nThe war between Israel and Hamas is being used by Trump-supporting Republicans to limit United States’ support for Ukraine. Republicans have blasted President Joe Biden for his decision to meet Xi Jinping, the Chinese president, during his trip to the APEC summit of Asian and Pacific states in California in November. Donald Trump’s threat to withdraw the US from Nato, if re-elected, risks further instability across Europe.\n<br>\n<br>\nAn existential problem\nUS foreign policy choices will shape the prospect for peace in Europe, Asia and the Middle East. America’s global role has been both anchored and amplified by the strength of its own democracy, so the US election poses a more existential problem. And that is for democracy itself − both within and beyond its borders.\n<br>\n<br>\nThe starting point for the 2024 elections is already a troubled one."
    },
    {
      "id": "6ef0",
      "title": "China takes more land in Bhutan before expected border deal",
      "body": "China has continued its unsanctioned programme of settlement construction across the contested border with Bhutan in the small kingdom’s Himalayan north, according to satellite imagery from September.\n<br>\n<br>\nThe new outposts in Bhutan’s remote Jakarlung Valley, part of the Beyul Khenpajong region, may become permanent Chinese territory after an announcement on a border deal between the two countries expected soon. It is thought that Bhutan, in a major concession, will give up the land that China has seized in both Jakarlung and the neighbouring Menchuma Valley.\n<br>\n<br>\nIn October, Tandi Dorji became the first Bhutanese foreign minister to travel to Beijing when he met Chinese Vice President Han Zheng, who described the long-running border talks a an ‘historic opportunity’. In the same month, Lotay Tshering, Bhutan’s prime minister at the time, told The Hindu newspaper: ‘We hope to see a line being drawn – this side Bhutan and that side China.’ Elections appointing a new government in Bhutan are expected in the new year."
    },
    {
      "id": "d7ee",
      "title": "Review: Will capitalism fix climate change?",
      "body": "At the end of his book, Akshat Rathi concludes that getting to zero emissions by a deadline will ‘mean changing everything’. But from the opening pages the tone of Climate Capitalism is one of acceptance that changing the capitalist system is just not possible.\n<br>\n<br>\nHe begins by setting out the system’s flaws: its extractive nature; the delusional ‘pursuit of endless growth at all costs’; the determination of many to ‘maximize profits … and the tendency of the system to concentrate wealth in the hands of the rich’. With these flaws in mind, he is resigned to the impossibility of change.\n<br>\n<br>\nRathi instead sets out to ‘harness the forces of capitalism’ to serve the climate, confident of success for the many private initiatives he has rigorously investigated – success that almost everywhere seems to rest on the support of a public, proactive state prepared to shoulder the risk."
    }
  ],
  "unfinishedTodos": [
    {
      "id": "85fe",
      "text": "Flour",
      "finished": false
    },
    {
      "id": "99d2",
      "text": "Milk",
      "finished": false
    }
  ],
  "finishedTodos": [
    {
      "id": "7831",
      "text": "Sausage",
      "finished": true
    }
  ],
  "checkedOnly": {
    "status": false
  }
}